#ifndef _DEFINE_H_SDLJFLSDJFLKDSO98203809_
#define _DEFINE_H_SDLJFLSDJFLKDSO98203809_

//####################################################################### LHS Added...
//
//  케릭터 관련
//
//####################################################################### LHS Added...

#define WALK_SPEED			1		// 단위 시간에 가는 거리
#define ATTACK_SPEED		800		// 공격 주기 ms

//####################################################################### LHS Added...
//
//	Async Message
//
//####################################################################### LHS Added...

#define WM_ASYNC	(WM_USER+10)



#endif